/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hs_database {
    _unused: [u8; 0],
}
/// A Hyperscan pattern database.
///
/// Generated by one of the Hyperscan compiler functions:
/// - @ref hs_compile()
/// - @ref hs_compile_multi()
/// - @ref hs_compile_ext_multi()
pub type hs_database_t = hs_database;
/// A type for errors returned by Hyperscan functions.
pub type hs_error_t = ::std::os::raw::c_int;
extern "C" {
    /// Free a compiled pattern database.
    ///
    /// The free callback set by @ref hs_set_database_allocator() (or @ref
    /// hs_set_allocator()) will be used by this function.
    ///
    /// @param db
    /// A compiled pattern database. NULL may also be safely provided, in which
    /// case the function does nothing.
    ///
    /// @return
    /// @ref HS_SUCCESS on success, other values on failure.
    pub fn hs_free_database(db: *mut hs_database_t) -> hs_error_t;
}
extern "C" {
    /// Serialize a pattern database to a stream of bytes.
    ///
    /// The allocator callback set by @ref hs_set_misc_allocator() (or @ref
    /// hs_set_allocator()) will be used by this function.
    ///
    /// @param db
    /// A compiled pattern database.
    ///
    /// @param bytes
    /// On success, a pointer to an array of bytes will be returned here.
    /// These bytes can be subsequently relocated or written to disk. The
    /// caller is responsible for freeing this block.
    ///
    /// @param length

    /// @ref HS_SUCCESS on success, @ref HS_ARCH_ERROR if system does not
    /// support Hyperscan.
    pub fn hs_valid_platform() -> hs_error_t;
}
/// A type containing error details that is returned by the compile calls (@ref
/// hs_compile(), @ref hs_compile_multi() and @ref hs_compile_ext_multi()) on
/// failure. The caller may inspect the values returned in this type to
/// determine the cause of failure.
///
/// Common errors generated during the compile process include:
///
/// - *Invalid parameter*
///
/// An invalid argument was specified in the compile call.
///
/// - *Unrecognised flag*
///
/// An unrecognised value was passed in the flags argument.
///
/// - *Pattern matches empty buffer*
///
/// By default, Hyperscan only supports patterns that will *always*
/// consume at least one byte of input. Patterns that do not have this
/// property (such as `/(abc)?/`) will produce this error unless
/// the @ref HS_FLAG_ALLOWEMPTY flag is supplied. Note that such
/// patterns will produce a match for *every* byte when scanned.
///
/// - *Embedded anchors not supported*
///
/// Hyperscan only supports the use of anchor meta-characters (such as
/// `^` and `$`) in patterns where they could *only* match
/// at the start or end of a buffer. A pattern containing an embedded
/// anchor, such as `/abc^def/`, can never match, as there is no
/// way for `abc` to precede the start of the data stream.
///
/// - *Bounded repeat is too large*
///
/// The pattern contains a repeated construct with very large finite
/// bounds.
///
/// - *Unsupported component type*
///
/// An unsupported PCRE construct was used in the pattern.
///
/// - *Unable to generate bytecode*
///
/// This error indicates that Hyperscan was unable to compile a pattern
/// that is syntactically valid. The most common cause is a pattern that is
/// very long and complex or contains a large repeated subpattern.
///
/// - *Unable to allocate memory*
///
/// The library was unable to allocate temporary storage used during
/// compilation time.
///
/// - *Allocator returned misaligned memory*
///
/// The memory allocator (either malloc() or the allocator set with @ref
/// hs_set_allocator()) did not correctly return memory suitably aligned
/// for the largest representable data type on this platform.
///
/// - *Internal error*
///
/// An unexpected error occurred: if this error is reported, please contact
/// the Hyperscan team with a description of the situation.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hs_compile_error {
    /// A human-readable error message describing the error.
    pub message: *mut ::std::os::raw::c_char,
    /// The zero-based number of the expression that caused the error (if this
    /// can be determined). If the error is not specific to an expression, then
    /// this value will be less than zero.
    pub expression: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_hs_compile_error() {
    assert_eq!(
        ::std::mem::size_of::<hs_compile_error>(),
        16usize,
        concat!("Size of: ", stringify!(hs_compile_error))
    );
    assert_eq!(
        ::std::mem::align_of::<hs_compile_error>(),
        8usize,
        concat!("Alignment of ", stringify!(hs_compile_error))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hs_compile_error>())).message as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hs_compile_error),
            "::",
            stringify!(message)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hs_compile_error>())).expression as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(hs_compile_error),
            "::",
            stringify!(expression)
        )
    );
}
pub type hs_compile_error_t = hs_compile_error;
/// A type containing information on the target platform which may optionally be
/// provided to the compile calls (@ref hs_compile(), @ref hs_compile_multi(),
/// @ref hs_compile_ext_multi()).
///
/// A hs_platform_info structure may be populated for the current platform by
/// using the @ref hs_populate_platform() call.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hs_platform_info {
    /// Information about the target platform which may be used to guide the
    /// optimisation process of the compile.
    ///
    /// Use of this field does not limit the processors that the resulting
    /// database can run on, but may impact the performance of the resulting
    /// database.
    pub tune: ::std::os::raw::c_uint,
    /// Relevant CPU features available on the target platform
    ///
    /// This value may be produced by combining HS_CPU_FEATURE_* flags (such as
    /// @ref HS_CPU_FEATURES_AVX2). Multiple CPU features may be or'ed together
    /// to produce the value.
    pub cpu_features: ::std::os::raw::c_ulonglong,
    /// Reserved for future use.
    pub reserved1: ::std::os::raw::c_ulonglong,
    /// Reserved for future use.
    pub reserved2: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_hs_platform_info() {
    assert_eq!(
        ::std::mem::size_of::<hs_platform_info>(),
        32usize,
        concat!("Size of: ", stringify!(hs_platform_info))
    );
    assert_eq!(
        ::std::mem::align_of::<hs_platform_info>(),
        8usize,
        concat!("Alignment of ", stringify!(hs_platform_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hs_platform_info>())).tune as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hs_platform_info),
            "::",
            stringify!(tune)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hs_platform_info>())).cpu_features as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(hs_platform_info),
            "::",
            stringify!(cpu_features)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hs_platform_info>())).reserved1 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(hs_platform_info),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hs_platform_info>())).reserved2 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(hs_platform_info),
            "::",
            stringify!(reserved2)
        )
    );
}
pub type hs_platform_info_t = hs_platform_info;
/// A type containing information related to an expression that is returned by
/// @ref hs_expression_info() or @ref hs_expression_ext_info.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hs_expr_info {
    /// The minimum length in bytes of a match for the pattern.
    ///
    /// Note: in some cases when using advanced features to suppress matches
    /// (such as extended parameters or the @ref HS_FLAG_SINGLEMATCH flag) this
    /// may represent a conservative lower bound for the true minimum length of
    /// a match.
    pub min_width: ::std::os::raw::c_uint,
    /// The maximum length in bytes of a match for the pattern. If the pattern
    /// has an unbounded maximum length, this will be set to the maximum value
    /// of an unsigned int (UINT_MAX).
    ///
    /// Note: in some cases when using advanced features to suppress matches
    /// (such as extended parameters or the @ref HS_FLAG_SINGLEMATCH flag) this
    /// may represent a conservative upper bound for the true maximum length of
    /// a match.
    pub max_width: ::std::os::raw::c_uint,
    /// Whether this expression can produce matches that are not returned in
    /// order, such as those produced by assertions. Zero if false, non-zero if
    /// true.
    pub unordered_matches: ::std::os::raw::c_char,
    /// Whether this expression can produce matches at end of data (EOD). In
    /// streaming mode, EOD matches are raised during @ref hs_close_stream(),
    /// since it is only when @ref hs_close_stream() is called that the EOD
    /// location is known. Zero if false, non-zero if true.
    ///
    /// Note: trailing `\b` word boundary assertions may also result in EOD
    /// matches as end-of-data can act as a word boundary.
    pub matches_at_eod: ::std::os::raw::c_char,
    /// Whether this expression can *only* produce matches at end of data (EOD).
    /// In streaming mode, all matches for this expression are raised during
    /// @ref hs_close_stream(). Zero if false, non-zero if true.
    pub matches_only_at_eod: ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_hs_expr_info() {
    assert_eq!(
        ::std::mem::size_of::<hs_expr_info>(),
        12usize,
        concat!("Size of: ", stringify!(hs_expr_info))
    );
    assert_eq!(
        ::std::mem::align_of::<hs_expr_info>(),
        4usize,
        concat!("Alignment of ", stringify!(hs_expr_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hs_expr_info>())).min_width as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hs_expr_info),
            "::",
            stringify!(min_width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hs_expr_info>())).max_width as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(hs_expr_info),
            "::",
            stringify!(max_width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hs_expr_info>())).unordered_matches as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(hs_expr_info),
            "::",
            stringify!(unordered_matches)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hs_expr_info>())).matches_at_eod as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(hs_expr_info),
            "::",
            stringify!(matches_at_eod)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hs_expr_info>())).matches_only_at_eod as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(hs_expr_info),
            "::",
            stringify!(matches_only_at_eod)
        )
    );
}
pub type hs_expr_info_t = hs_expr_info;
/// A structure containing additional parameters related to an expression,
/// passed in at build time to @ref hs_compile_ext_multi() or @ref
/// hs_expression_ext_info.
///
/// These parameters allow the set of matches produced by a pattern to be
/// constrained at compile time, rather than relying on the application to
/// process unwanted matches at runtime.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hs_expr_ext {
    /// Flags governing which parts of this structure are to be used by the
    /// compiler. See @ref HS_EXT_FLAG.
    pub flags: ::std::os::raw::c_ulonglong,
    /// The minimum end offset in the data stream at which this expression
    /// should match successfully. To use this parameter, set the
    /// @ref HS_EXT_FLAG_MIN_OFFSET flag in the hs_expr_ext::flags field.
    pub min_offset: ::std::os::raw::c_ulonglong,
    /// The maximum end offset in the data stream at which this expression
    /// should match successfully. To use this parameter, set the
    /// @ref HS_EXT_FLAG_MAX_OFFSET flag in the hs_expr_ext::flags field.
    pub max_offset: ::std::os::raw::c_ulonglong,
    /// The minimum match length (from start to end) required to successfully
    /// match this expression. To use this parameter, set the
    /// @ref HS_EXT_FLAG_MIN_LENGTH flag in the hs_expr_ext::flags field.
    pub min_length: ::std::os::raw::c_ulonglong,
    /// Allow patterns to approximately match within this edit distance. To use
    /// this parameter, set the @ref HS_EXT_FLAG_EDIT_DISTANCE flag in the
    /// hs_expr_ext::flags field.
    pub edit_distance: ::std::os::raw::c_uint,
    /// Allow patterns to approximately match within this Hamming distance. To
    /// use this parameter, set the @ref HS_EXT_FLAG_HAMMING_DISTANCE flag in the
    /// hs_expr_ext::flags field.
    pub hamming_distance: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_hs_expr_ext() {
    assert_eq!(
        ::std::mem::size_of::<hs_expr_ext>(),
        40usize,
        concat!("Size of: ", stringify!(hs_expr_ext))
    );
    assert_eq!(
        ::std::mem::align_of::<hs_expr_ext>(),
        8usize,
        concat!("Alignment of ", stringify!(hs_expr_ext))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hs_expr_ext>())).flags as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(hs_expr_ext), "::", stringify!(flags))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hs_expr_ext>())).min_offset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(hs_expr_ext),
            "::",
            stringify!(min_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hs_expr_ext>())).max_offset as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(hs_expr_ext),
            "::",
            stringify!(max_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hs_expr_ext>())).min_length as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(hs_expr_ext),
            "::",
            stringify!(min_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hs_expr_ext>())).edit_distance as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(hs_expr_ext),
            "::",
            stringify!(edit_distance)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hs_expr_ext>())).hamming_distance as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(hs_expr_ext),
            "::",
            stringify!(hamming_distance)
        )
    );
}
pub type hs_expr_ext_t = hs_expr_ext;
extern "C" {
    /// The basic regular expression compiler.
    ///
    /// This is the function call with which an expression is compiled into a
    /// Hyperscan database which can be passed to the runtime functions (such as
    /// @ref hs_scan(), @ref hs_open_stream(), etc.)
    ///
    /// @param expression
    /// The NULL-terminated expression to parse. Note that this string must
    /// represent ONLY the pattern to be matched, with no delimiters or flags;
    /// any global flags should be specified with the @p flags argument. For
    /// example, the expression `/abc?def/i` should be compiled by providing
    /// `abc?def` as the @p expression, and @ref HS_FLAG_CASELESS as the @a
    /// flags.
    ///
    /// @param flags
    /// Flags which modify the behaviour of the expression. Multiple flags may
